[M_SlapHappy MissionDefinition]
MissionName="He is asleep"
MissionDescription="Knight Hammerlock hires you to kill the assassin who killed him last year. You need to get old Slappy out of bed with something sweet.."
TurnInDescription="Old Slappy is dead, but who gave him this name and why remains a mystery.."
MissionSummary="Hit the old water."
MissionGiver="Lord Hammerlock"
MissionTurnInLocation="Mr. Hammerlock"
TeaserText="Revenge is a special diet that can disrupt the diet and lead to death. And you have to poison the food."

[M_SlapHappy:KillSlappy MissionObjectiveDefinition]
ProgressMessage="Kill old sloppy"

[M_SlapHappy:KillSlappySet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_SlapHappy:PlaceArm MissionObjectiveDefinition]
ProgressMessage="Hold your hand"

[M_SlapHappy:PlaceArm_ObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_SlapHappy:RetrieveArm MissionObjectiveDefinition]
ProgressMessage="Put your hand back"

[M_SlapHappy:RetrieveArm_ObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_SlapHappy:TakeArm MissionObjectiveDefinition]
ProgressMessage="Hammer lock handle"

[M_SlapHappy:TakeArm_ObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

